Revit 2027 API
MassLevelData.IsMassFamilyInstance Method
 Checks if the ElementId is a mass family instance.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsMassFamilyInstance(
	Document document,
	ElementId id
)
Public Shared Function IsMassFamilyInstance (
	document As Document,
	id As ElementId
) As Boolean
public:
static bool IsMassFamilyInstance(
	Document^ document,
	ElementId^ id
)
static member IsMassFamilyInstance :
        document : Document *
        id : ElementId -> bool
Parameters
document Document
 The document.
id ElementId
 The ElementId to be checked.
Return Value
Boolean
 True if the ElementId is a mass family instance, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MassLevelData Class
Autodesk.Revit.DB.Analysis Namespace